InformationRegisters/ЛБ_РеестрБезначныхПлатежейПереплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеестрБезначныхПлатежейПереплаты</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыБезналичныхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаСотрудникомЦО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПереплатаНачальная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЛБ_ИсторияПереплаты/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РеестрПлатежей") Тогда
		РеестрПлатежей = Параметры.РеестрПлатежей;
	КонецЕсли;	
	Если Параметры.Свойство("НомерЗБ") Тогда
		НомерЗБ = Параметры.НомерЗБ;
	КонецЕсли;	 
	Если Параметры.Свойство("ДатаПлатежа") Тогда
		ДатаПлатежа = Параметры.ДатаПлатежа;
	КонецЕсли;	 
	Если Параметры.Свойство("ИдентификаторПлатежа") Тогда
		ИдентификаторПлатежа = Параметры.ИдентификаторПлатежа;
	КонецЕсли;	 
	Если Параметры.Свойство("СуммаПлатежа") Тогда
		СуммаПлатежа = Параметры.СуммаПлатежа;
	КонецЕсли;	 
	Если Параметры.Свойство("Переплата") Тогда
		Переплата = Параметры.Переплата;
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если НЕ ЗначениеЗаполнено(РеестрПлатежей) Тогда
		Предупреждение("Не выбран реестр платежей!", 60);
		Отказ = Истина;
	КонецЕсли;  
	ВывестиИсторию();
КонецПроцедуры

&НаСервере
Процедура ВывестиИсторию()  
	Элементы.ДекорацияПлатеж.Заголовок = "Реестр № " + СокрЛП(РеестрПлатежей.НомерРеестра) + " от " + Формат(РеестрПлатежей.Дата, "ДФ=dd.MM.yyyy") + 
	    Символы.ПС + "Платеж № " + СокрЛП(ИдентификаторПлатежа) + " от " + формат(ДатаПлатежа, "ДЛФ=DT") + " на сумму " + СокрЛП(Формат(СуммаПлатежа, "ЧЦ=15; ЧДЦ=2")) + " руб." +
		Символы.ПС + "Залоговый билет № " + СокрЛП(НомерЗБ) + 
		Символы.ПС + "Переплата " + СокрЛП(Формат(Переплата, "ЧЦ=15; ЧДЦ=2")) + " руб.";
	Запрос = новый Запрос;    
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);  
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
	Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РаспределениеПереплаты.Период КАК Дата,
	               |	ЛБ_РаспределениеПереплаты.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РаспределениеПереплаты.Переплата КАК Переплата,
	               |	ЛБ_РаспределениеПереплаты.ОтменаСотрудникомЦО КАК ОтменаСотрудникомЦО,
	               |	ЛБ_РаспределениеПереплаты.Ответственный КАК Ответственный,
	               |	ЛБ_РаспределениеПереплаты.СтатусПлатежа КАК СтатусПлатежа
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежейПереплаты КАК ЛБ_РаспределениеПереплаты
	               |ГДЕ
	               |	ЛБ_РаспределениеПереплаты.РеестрПлатежей = &РеестрПлатежей
	               |	И ЛБ_РаспределениеПереплаты.НомерЗБ = &НомерЗБ
	               |	И ЛБ_РаспределениеПереплаты.ДатаПлатежа = &ДатаПлатежа
	               |	И ЛБ_РаспределениеПереплаты.ИдентификаторПлатежа = &ИдентификаторПлатежа
	               |	И НЕ ЛБ_РаспределениеПереплаты.Регистратор = &РеестрПлатежей
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
   	ИсторияИзменений.Очистить();
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		НоваяСтр = ИсторияИзменений.Добавить();  
		НоваяСтр.Дата = Стр.Дата;
		НоваяСтр.СтатусПлатежа = Стр.СтатусПлатежа; 
		НоваяСтр.Ответственный = Стр.Ответственный;
		НоваяСтр.Переплата = Стр.Переплата; 
		Если ЗначениеЗаполнено(Стр.ЗалоговыйБилет) И НЕ (СокрЛП(Стр.ЗалоговыйБилет.НомерЗалоговогоБилета) = СокрЛП(НомерЗБ)) Тогда 
			НоваяСтр.НомерЗБНовый = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета; 
		КонецЕсли;	
	Конеццикла;	
КонецПроцедуры
